; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=78, out_folder=htg/blocksworld/training, instance_id=58, seed=2082

(define (problem blocksworld-58)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 - object)
 (:init 
    (arm-empty)
    (clear b19)
    (on b19 b38)
    (on b38 b69)
    (on b69 b63)
    (on b63 b22)
    (on b22 b55)
    (on b55 b58)
    (on b58 b24)
    (on-table b24)
    (clear b66)
    (on b66 b33)
    (on-table b33)
    (clear b74)
    (on b74 b68)
    (on b68 b41)
    (on b41 b37)
    (on b37 b77)
    (on b77 b16)
    (on b16 b45)
    (on b45 b28)
    (on-table b28)
    (clear b60)
    (on b60 b57)
    (on b57 b49)
    (on b49 b26)
    (on b26 b64)
    (on b64 b51)
    (on b51 b17)
    (on b17 b4)
    (on b4 b75)
    (on b75 b6)
    (on b6 b31)
    (on b31 b7)
    (on b7 b52)
    (on b52 b1)
    (on b1 b71)
    (on-table b71)
    (clear b70)
    (on b70 b56)
    (on b56 b34)
    (on b34 b20)
    (on b20 b29)
    (on b29 b2)
    (on b2 b78)
    (on b78 b61)
    (on b61 b53)
    (on b53 b50)
    (on b50 b35)
    (on b35 b39)
    (on b39 b30)
    (on b30 b65)
    (on b65 b13)
    (on b13 b11)
    (on-table b11)
    (clear b62)
    (on b62 b43)
    (on b43 b46)
    (on b46 b42)
    (on b42 b8)
    (on b8 b32)
    (on b32 b40)
    (on-table b40)
    (clear b48)
    (on-table b48)
    (clear b25)
    (on b25 b59)
    (on-table b59)
    (clear b5)
    (on b5 b72)
    (on b72 b9)
    (on b9 b76)
    (on b76 b73)
    (on b73 b18)
    (on b18 b12)
    (on b12 b14)
    (on b14 b47)
    (on b47 b67)
    (on b67 b23)
    (on b23 b27)
    (on b27 b36)
    (on b36 b44)
    (on b44 b21)
    (on b21 b3)
    (on b3 b54)
    (on b54 b10)
    (on b10 b15)
    (on-table b15))
 (:goal  (and 
    (clear b6)
    (on b6 b7)
    (on b7 b4)
    (on b4 b1)
    (on b1 b5)
    (on b5 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b60 b57)
   deleted: (on b60 b57) (clear b60) (arm-empty)
   added: (holding b60) (clear b57)
   goals met: 0 of 8
2. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 0 of 8
3. (unstack b57 b49)
   deleted: (on b57 b49) (clear b57) (arm-empty)
   added: (holding b57) (clear b49)
   goals met: 0 of 8
4. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 0 of 8
5. (unstack b70 b56)
   deleted: (on b70 b56) (clear b70) (arm-empty)
   added: (holding b70) (clear b56)
   goals met: 0 of 8
6. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 0 of 8
7. (unstack b49 b26)
   deleted: (on b49 b26) (clear b49) (arm-empty)
   added: (holding b49) (clear b26)
   goals met: 0 of 8
8. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 0 of 8
9. (unstack b26 b64)
   deleted: (on b26 b64) (clear b26) (arm-empty)
   added: (holding b26) (clear b64)
   goals met: 0 of 8
10. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 8
11. (unstack b64 b51)
   deleted: (on b64 b51) (clear b64) (arm-empty)
   added: (holding b64) (clear b51)
   goals met: 0 of 8
12. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 0 of 8
13. (unstack b51 b17)
   deleted: (on b51 b17) (clear b51) (arm-empty)
   added: (holding b51) (clear b17)
   goals met: 0 of 8
14. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 0 of 8
15. (unstack b17 b4)
   deleted: (on b17 b4) (clear b17) (arm-empty)
   added: (holding b17) (clear b4)
   goals met: 0 of 8
16. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 8
17. (unstack b4 b75)
   deleted: (on b4 b75) (clear b4) (arm-empty)
   added: (holding b4) (clear b75)
   goals met: 0 of 8
18. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 8
19. (unstack b75 b6)
   deleted: (on b75 b6) (clear b75) (arm-empty)
   added: (holding b75) (clear b6)
   goals met: 1 of 8
20. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 1 of 8
21. (unstack b56 b34)
   deleted: (on b56 b34) (clear b56) (arm-empty)
   added: (holding b56) (clear b34)
   goals met: 1 of 8
22. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 1 of 8
23. (unstack b34 b20)
   deleted: (on b34 b20) (clear b34) (arm-empty)
   added: (holding b34) (clear b20)
   goals met: 1 of 8
24. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 1 of 8
25. (unstack b20 b29)
   deleted: (on b20 b29) (clear b20) (arm-empty)
   added: (holding b20) (clear b29)
   goals met: 1 of 8
26. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 8
27. (unstack b29 b2)
   deleted: (on b29 b2) (clear b29) (arm-empty)
   added: (holding b29) (clear b2)
   goals met: 1 of 8
28. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 1 of 8
29. (unstack b5 b72)
   deleted: (on b5 b72) (clear b5) (arm-empty)
   added: (holding b5) (clear b72)
   goals met: 1 of 8
30. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 2 of 8
31. (unstack b6 b31)
   deleted: (on b6 b31) (clear b6) (arm-empty)
   added: (holding b6) (clear b31)
   goals met: 1 of 8
32. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 8
33. (unstack b31 b7)
   deleted: (on b31 b7) (clear b31) (arm-empty)
   added: (holding b31) (clear b7)
   goals met: 2 of 8
34. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 8
35. (unstack b7 b52)
   deleted: (on b7 b52) (clear b7) (arm-empty)
   added: (holding b7) (clear b52)
   goals met: 2 of 8
36. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 3 of 8
37. (unstack b72 b9)
   deleted: (on b72 b9) (clear b72) (arm-empty)
   added: (holding b72) (clear b9)
   goals met: 3 of 8
38. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 3 of 8
39. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 2 of 8
40. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 4 of 8
41. (unstack b52 b1)
   deleted: (on b52 b1) (clear b52) (arm-empty)
   added: (holding b52) (clear b1)
   goals met: 4 of 8
42. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 8
43. (unstack b1 b71)
   deleted: (on b1 b71) (clear b1) (arm-empty)
   added: (holding b1) (clear b71)
   goals met: 4 of 8
44. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 5 of 8
45. (unstack b9 b76)
   deleted: (on b9 b76) (clear b9) (arm-empty)
   added: (holding b9) (clear b76)
   goals met: 5 of 8
46. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 5 of 8
47. (unstack b76 b73)
   deleted: (on b76 b73) (clear b76) (arm-empty)
   added: (holding b76) (clear b73)
   goals met: 5 of 8
48. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 5 of 8
49. (unstack b73 b18)
   deleted: (on b73 b18) (clear b73) (arm-empty)
   added: (holding b73) (clear b18)
   goals met: 5 of 8
50. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 5 of 8
51. (unstack b18 b12)
   deleted: (on b18 b12) (clear b18) (arm-empty)
   added: (holding b18) (clear b12)
   goals met: 5 of 8
52. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 5 of 8
53. (unstack b12 b14)
   deleted: (on b12 b14) (clear b12) (arm-empty)
   added: (holding b12) (clear b14)
   goals met: 5 of 8
54. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 8
55. (unstack b14 b47)
   deleted: (on b14 b47) (clear b14) (arm-empty)
   added: (holding b14) (clear b47)
   goals met: 5 of 8
56. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 5 of 8
57. (unstack b47 b67)
   deleted: (on b47 b67) (clear b47) (arm-empty)
   added: (holding b47) (clear b67)
   goals met: 5 of 8
58. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 5 of 8
59. (unstack b67 b23)
   deleted: (on b67 b23) (clear b67) (arm-empty)
   added: (holding b67) (clear b23)
   goals met: 5 of 8
60. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 5 of 8
61. (unstack b23 b27)
   deleted: (on b23 b27) (clear b23) (arm-empty)
   added: (holding b23) (clear b27)
   goals met: 5 of 8
62. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 5 of 8
63. (unstack b27 b36)
   deleted: (on b27 b36) (clear b27) (arm-empty)
   added: (holding b27) (clear b36)
   goals met: 5 of 8
64. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 5 of 8
65. (unstack b36 b44)
   deleted: (on b36 b44) (clear b36) (arm-empty)
   added: (holding b36) (clear b44)
   goals met: 5 of 8
66. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 5 of 8
67. (unstack b44 b21)
   deleted: (on b44 b21) (clear b44) (arm-empty)
   added: (holding b44) (clear b21)
   goals met: 5 of 8
68. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 5 of 8
69. (unstack b21 b3)
   deleted: (on b21 b3) (clear b21) (arm-empty)
   added: (holding b21) (clear b3)
   goals met: 5 of 8
70. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 5 of 8
71. (unstack b3 b54)
   deleted: (on b3 b54) (clear b3) (arm-empty)
   added: (holding b3) (clear b54)
   goals met: 5 of 8
72. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 8
73. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 5 of 8
74. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 8
75. (unstack b5 b2)
   deleted: (on b5 b2) (clear b5) (arm-empty)
   added: (holding b5) (clear b2)
   goals met: 4 of 8
76. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 8
77. (unstack b2 b78)
   deleted: (on b2 b78) (clear b2) (arm-empty)
   added: (holding b2) (clear b78)
   goals met: 4 of 8
78. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 5 of 8
79. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 5 of 8
80. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 6 of 8
81. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 8
82. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 7 of 8
83. (unstack b6 b7)
   deleted: (on b6 b7) (clear b6) (arm-empty)
   added: (holding b6) (clear b7)
   goals met: 5 of 8
84. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 8
85. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 5 of 8
86. (stack b7 b78)
   deleted: (clear b78) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b78)
   goals met: 5 of 8
87. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 8
88. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 6 of 8
89. (unstack b7 b78)
   deleted: (on b7 b78) (clear b7) (arm-empty)
   added: (holding b7) (clear b78)
   goals met: 6 of 8
90. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 7 of 8
91. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 6 of 8
92. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 8 of 8
